////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере()
	
	Если Валюта.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить значение валюты";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СерверЦБ = "cbr.ru";
	АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ТекущаяДатаСеанса(), "ДФ=dd/MM/yyyy");
	
	ВозвращаемыеДанные = РаботаСHTTP.ПолучитьДанныеССервераЦБ(СерверЦБ, АдресЗапроса);
	
	Если Не ВозвращаемыеДанные.Успешно Тогда
		Сообщить(ВозвращаемыеДанные.ТекстОшибки);
		Возврат;
	ИначеЕсли ВозвращаемыеДанные.HTTPОтвет.КодСостояния <> 200 Тогда
		Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемыеДанные.HTTPОтвет.КодСостояния));
		возврат;
	КонецЕсли;
	
	СтрокаXML = ВозвращаемыеДанные.HTTPОтвет.ПолучитьТелоКакСтроку();
	ЗначениеИдентификатораВалюты = ИдентификаторВалюты(Валюта);
	ПрочитатьИзXMLПоследовательно(СтрокаXML, ЗначениеИдентификатораВалюты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторВалюты(Валюта)
	
	Идентификатор = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.ИдентификаторЦБ КАК ИдентификаторЦБ
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Идентификатор =  ВыборкаДетальныеЗаписи.ИдентификаторЦБ;
	КонецЕсли;	
	
	Возврат Идентификатор;
	
КонецФункции


&НаСервере
Процедура ПрочитатьИзXMLПоследовательно(СтрокаXML, ЗначениеИдентификатораВалюты)
	
	Если ПустаяСтрока(ЗначениеИдентификатораВалюты) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить идентификатор выбранной валюты";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ЭтаВалютаЕстьВДанных = Ложь;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
				Если ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "ЗначениеИдентификатораВалюты" Тогда
					ЭтаВалютаЕстьВДанных = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЭтаВалютаЕстьВДанных 
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И ЧтениеXML.Имя = "VunitRate" Тогда
			ЧтениеXML.Прочитать();
			Если Валюта = "USD" Тогда //4
				КурсДоллараНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "EURO" Тогда
				КурсЕвроНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "CNY" Тогда
				КурсЮаняНаСегодня = ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры 

	
	#КонецОбласти

