
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеССервераЦБ(СерверЦБ, АдресЗапроса) Экспорт
		
	ЭтоУспешныйЗапрос = Истина;
	ТекстОшибки = "";
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("Content-Type", "application/json; charset=UTF-8");
	ЗаголовкиHTTP.Вставить("Accept", "application/json");
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовкиHTTP);
	HTTPОтвет   = Неопределено;
	
	Попытка
		
		Соединение = Новый HTTPСоединение(СерверЦБ,,,,,30);
		HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЭтоУспешныйЗапрос = Ложь;
		
	КонецПопытки;
	
	ВозвращаемыеДанные = Новый Структура;
	ВозвращаемыеДанные.Вставить("HTTPМетод",                    "GET");
	ВозвращаемыеДанные.Вставить("HTTPЗапрос",                   HTTPЗапрос);
	ВозвращаемыеДанные.Вставить("HTTPОтвет",                    HTTPОтвет);
	ВозвращаемыеДанные.Вставить("ТекстОшибки",                  ТекстОшибки);
	ВозвращаемыеДанные.Вставить("Успешно",  		            ЭтоУспешныйЗапрос);
	
	Возврат ВозвращаемыеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти